ERP.belugaerp/src/Enums/СтатусыДоговоровКонтрагентов/СтатусыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыДоговоровКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Действует</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/СтатусыСертификатовНоменклатуры/СтатусыСертификатовНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыСертификатовНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Действующий</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Недействующий</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ДоговорыКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>бг_АвтоматическиФормироватьЗаявкиНаРасходованиеДС</name>
    <comment>Проект &quot;Магистраль&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ВидВзаиморасчетов</name>
    <type>
      <types>CatalogRef.бг_ВидыВзаиморасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ВидПеревозки</name>
    <comment>Вид перевозки для заполнения в транспортном разделе</comment>
    <type>
      <types>CatalogRef.бг_ВидыПеревозки</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_МаксимальнаяСтраховаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОтсрочкаПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ПроцентФинансированияФакторинга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Соглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ШаблонТекстаНазначенияПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОплатаВВалюте</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СрокОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъектРасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>бг_НастройкиОплатыЧерезФакторинговуюКомпанию</name>
    <attributes>
      <name>КонтрагентФактор</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>БанковскийСчетФактора</name>
      <type>
        <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаДействия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияДействия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP.belugaerp/src/Catalogs/СертификатыНоменклатуры/СертификатыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СертификатыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>бг_УдалитьАдресФайлаСертификата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ВладелецСертификата</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Бессрочный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаСрокаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСрокаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

ERP.belugaerp/src/CommonModules/бг_ЗакрытиеДоговоровДекларацийСоответствия/Module.bsl
#Область ПрограммныйИнтерфейс

// Процедура - Запускает изменение статусов у элементов справочников:
//	1. СертификатыНоменклатуры - по окончанию срока действия меняется статус на "Недействующий"
//	2. ДоговорыКонтрагентов - по окончанию срока действия меняется статус на "Закрыт"
//
Процедура ЗакрытьДоговораДекларацииСоответствия() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	ДанныеДляЗакрытия = ДанныеДляЗакрытия();
	
	ЗакрытьИстекшиеДоговораКонтрагентов(ДанныеДляЗакрытия.ДоговорыКонтрагентов);
	ЗакрытьИстекшиеДекларацииСоответствия(ДанныеДляЗакрытия.ДекларацииСоответствия);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеДляЗакрытия()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК ДоговорКонтрагента
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ДатаОкончанияДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|	И &ТекущаяДата > КОНЕЦПЕРИОДА(ДоговорыКонтрагентов.ДатаОкончанияДействия, ДЕНЬ)
	|	И ДоговорыКонтрагентов.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Закрыт)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДоговорыКонтрагентов.ДатаОкончанияДействия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СертификатыНоменклатуры.Ссылка КАК ДекларацияСоответствия
	|ИЗ
	|	Справочник.СертификатыНоменклатуры КАК СертификатыНоменклатуры
	|ГДЕ
	|	СертификатыНоменклатуры.ДатаОкончанияСрокаДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|	И &ТекущаяДата > КОНЕЦПЕРИОДА(СертификатыНоменклатуры.ДатаОкончанияСрокаДействия, ДЕНЬ)
	|	И СертификатыНоменклатуры.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыСертификатовНоменклатуры.Недействующий)
	|	И СертификатыНоменклатуры.ТипСертификата = &ТипСертификата
	|	И НЕ СертификатыНоменклатуры.Бессрочный
	|
	|УПОРЯДОЧИТЬ ПО
	|	СертификатыНоменклатуры.ДатаОкончанияСрокаДействия";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ТипСертификата", "Декларация о соответствии");
	
	Результаты = Запрос.ВыполнитьПакет();
	
	ДанныеДляЗакрытия = Новый Структура;
	
	ДанныеДляЗакрытия.Вставить(
		"ДоговорыКонтрагентов", 
		Результаты[0].Выгрузить().ВыгрузитьКолонку("ДоговорКонтрагента"));
		
	ДанныеДляЗакрытия.Вставить(
		"ДекларацииСоответствия", 
		Результаты[1].Выгрузить().ВыгрузитьКолонку("ДекларацияСоответствия"));

	Возврат ДанныеДляЗакрытия;
	
КонецФункции

Процедура ЗакрытьИстекшиеДоговораКонтрагентов(ДоговорыКЗакрытию)
	
	ШаблонОшибки = НСтр("ru='Закрытие договоров контрагентов: %ОписаниеОшибки%'");
	
	Для Каждого ДоговорКонтрагента Из ДоговорыКЗакрытию Цикл
		
		Попытка
			ДоговорКонтрагентаОбъект = ДоговорКонтрагента.ПолучитьОбъект();
			ДоговорКонтрагентаОбъект.Статус = Перечисления.СтатусыДоговоровКонтрагентов.Закрыт;
		
			ДоговорКонтрагентаОбъект.Записать();
		Исключение
			
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка,,
				ДоговорКонтрагента,
				СтрЗаменить(ШаблонОшибки, "%ОписаниеОшибки%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
				
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры 

Процедура ЗакрытьИстекшиеДекларацииСоответствия(ДекларацииКЗакрытию)
	
	ШаблонОшибки = НСтр("ru='Закрытие деклараций о соответствии: %ОписаниеОшибки%'");
	
	Для Каждого ДекларацияСоответствия Из ДекларацииКЗакрытию Цикл
		
		Попытка
			ДекларацияСоответствияОбъект = ДекларацияСоответствия.ПолучитьОбъект();
			ДекларацияСоответствияОбъект.Статус = Перечисления.СтатусыСертификатовНоменклатуры.Недействующий;
			
			ДекларацияСоответствияОбъект.Записать();
		Исключение
			
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка,,
				ДекларацияСоответствия,
				СтрЗаменить(ШаблонОшибки, "%ОписаниеОшибки%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
